title: Nginx Remote File Inclusion (RFI) Attempt
id: nginx-rfi-001
status: experimental
description: Detects remote file inclusion attempts in Nginx access logs
references:
  - https://owasp.org/www-community/attacks/Remote_File_Inclusion
author: Sachin1785
logsource:
  product: web
  service: nginx
  category: webserver
detection:
  selection:
    Url|contains:
      - "http://"
      - "https://"
      - "ftp://"
      - "php?file="
      - "?page=http"
      - "?inc=http"
      - "?module=http"
      - "?url=http"
      - "?template=http"
  condition: selection
falsepositives:
  - Penetration testing
level: high
