title: Nginx Path Probing Attempt
id: nginx-path-probing-001
status: experimental
description: Detects requests for sensitive or administrative paths in Nginx access logs
references:
  - https://owasp.org/www-community/attacks/Path_Traversal
author: Sachin1785
logsource:
  product: web
  service: nginx
  category: webserver
detection:
  selection:
    Url|contains:
      - "/admin"
      - "/config.php"
      - "/wp-login.php"
      - "/.git"
      - "/.env"
      - "/phpmyadmin"
      - "/setup.php"
      - "/install.php"
      - "/backup"
      - "/db"
      - "/private"
  condition: selection
falsepositives:
  - Legitimate admin access
level: medium
